# Taps
tap "nikitabobko/tap"          # AeroSpace
tap "FelixKratz/formulae"      # SketchyBar, JankyBorders

# ---- Core CLI ----
brew "gh"                      # GitHub command-line tool
brew "gitleaks"                # Audit git repos for secrets
brew "jq"                      # Command-line JSON processor
brew "zsh"                     # UNIX shell

# ---- Prompt / shell UX ----
brew "starship"                # Cross-shell prompt
brew "zsh-autosuggestions"     # Fish-like autosuggestions
brew "zsh-syntax-highlighting" # Syntax highlighting for zsh

# ---- Modern CLI replacements ----
brew "fzf"                     # Fuzzy finder
brew "fd"                      # Better find
brew "bat"                     # Better cat
brew "eza"                     # Better ls
brew "zoxide"                  # Better cd
brew "yazi"                    # TUI file manager
brew "thefuck"                 # Command correction

# ---- Window manager / bar / borders ----
cask "nikitabobko/tap/aerospace"       # i3-like tiling WM for macOS
brew "FelixKratz/formulae/sketchybar"  # Custom macOS status bar
brew "FelixKratz/formulae/borders"     # JankyBorders — active window borders

# ---- Apps ----
cask "ghostty"                 # Terminal
cask "karabiner-elements"      # Keyboard remapper
cask "1password-cli"           # 1Password CLI (SSH agent support)
