# Taps
tap "nikitabobko/tap"          # AeroSpace
tap "FelixKratz/formulae"      # SketchyBar, JankyBorders

# ---- Core CLI ----
brew "gh"                      # GitHub command-line tool
brew "gitleaks"                # Audit git repos for secrets
brew "jq"                      # Command-line JSON processor
brew "zsh"                     # UNIX shell

# ---- Prompt / shell UX ----
brew "starship"                # Cross-shell prompt
brew "zsh-autosuggestions"     # Fish-like autosuggestions
brew "zsh-syntax-highlighting" # Syntax highlighting for zsh

# ---- Modern CLI replacements ----
brew "fzf"                     # Fuzzy finder
brew "fd"                      # Better find
brew "bat"                     # Better cat
brew "eza"                     # Better ls
brew "zoxide"                  # Better cd
brew "yazi"                    # TUI file manager
brew "thefuck"                 # Command correction
brew "tmux"                    # Terminal multiplexer
brew "ical-buddy"              # Query macOS Calendar from the CLI (sketchybar calendar pill)
brew "blueutil"                # CLI bluetooth control (sketchybar bluetooth pill)

# ---- Window manager / bar / borders ----
cask "nikitabobko/tap/aerospace"       # i3-like tiling WM for macOS
brew "FelixKratz/formulae/sketchybar"  # Custom macOS status bar
brew "FelixKratz/formulae/borders"     # JankyBorders — active window borders

# ---- Fonts ----
cask "font-hack-nerd-font"           # Terminal + sketchybar icons
cask "sketchybar-app-font"           # App icons inside sketchybar workspace pills

# ---- Apps ----
cask "ghostty"                       # Terminal
cask "karabiner-elements"            # Keyboard remapper
cask "1password-cli"                 # 1Password CLI (SSH agent support)
cask "claude-code"                   # Anthropic's CLI coding agent
cask "windsurf"                      # Code editor (alt-c)
cask "google-chrome"                 # Browser (alt-b)
cask "slack"                         # Chat (alt-s)
cask "obsidian"                      # Notes (alt-w)
cask "wispr-flow"                    # Voice-to-text / AI dictation (sketchybar center pill)

# ---- Not available via brew (install manually) ----
# ccusage: Claude Code token/cost tracker — `npm install -g ccusage`
#         Required by sketchybar/plugins/ccusage.sh
#         Needs Node.js (already present via Homebrew's `node` dependency chain).
